import React from 'react';

const Question = () => {
    return (
        <div>
            <div>
                <h4>How React wroks?</h4>
                <p>রিয়েক্ট হল জাভাস্ক্রিপ্ট এর লাইব্রেরি। এটা ভার্চুয়াল ডম এর মাধ্যমে কাজ করে। রিয়েক্ট সাধারনত ডম tree মেইনটেইন করে আমাদের জন্য। এই ডম tree কার্যকারি পরিবর্তন নিয়ে আসে nodes মধ্য। রিয়েক্ট আমাদের অনুমতি দেই ডম এর পরিবর্তন করার জন্য।আর এটা সম্ভব হই ভার্চুয়াল ডম এর কারনে। রিয়েক্ট ভার্চুয়াল ডম ব্যাবহার করে রেনডার দেখানোর জন্য।
ভার্চুয়াল ডম কম্পেয়ার করে থাকে ডম এর সাথে.</p>

            </div>
        </div>
    );
};

export default Question;